# AssociateRegionWithLayer Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CompoundStructure..::..AssociateRegionWithLayer Method
CompoundStructure Class See Also
---
Associates a region with a layer.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void AssociateRegionWithLayer(
	int regionId,
	int layerIdx
)
```

Visual Basic
---
```text
Public Sub AssociateRegionWithLayer ( _
	regionId As Integer, _
	layerIdx As Integer _
)
```

Visual C++
---
```text
public:
void AssociateRegionWithLayer(
	int regionId,
	int layerIdx
)
```

# ### Parameters
regionId
    Type: System..::..Int32 The id of a region.
layerIdx
    Type: System..::..Int32 The index of a layer in this CompoundStructure.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | It is not a valid region id. |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The layer index is out of range. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This operation is valid only for vertically compound structures. |

# See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace